[
  {
    "id": 1,
    "concept": "conduction",
    "title_en": "Steel Plate Cooking (Tawa)",
    "title_te": "స్టీల్ పళ్ళెం వంట (తవా)",
    "description_en": "When making dosas or rotis on a hot tawa (steel plate), heat travels from the flame through the metal to cook the food. The handle stays cooler because wood or plastic doesn't conduct heat well.",
    "description_te": "వేడి తవాపై దోశలు లేదా రోటీలు తయారు చేసేటప్పుడు, వేడి మంట నుండి లోహం ద్వారా ఆహారాన్ని వండడానికి ప్రయాణిస్తుంది. చెక్క లేదా ప్లాస్టిక్ వేడిని బాగా ప్రసరింపజేయవు కాబట్టి హ్యాండిల్ చల్లగా ఉంటుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 2,
    "concept": "conduction",
    "title_en": "Stirring Hot Tea with Metal Spoon",
    "title_te": "వేడి టీని లోహపు చెంచాతో కదిలించడం",
    "description_en": "When you stir hot tea with a stainless steel spoon, the handle quickly becomes too hot to touch. This shows how metal conducts heat rapidly from the hot tea through the spoon to your hand.",
    "description_te": "మీరు వేడి టీని స్టెయిన్‌లెస్ స్టీల్ చెంచాతో కదిలిస్తే, హ్యాండిల్ త్వరగా తాకడానికి చాలా వేడిగా మారుతుంది. ఇది లోహం వేడి టీ నుండి చెంచా ద్వారా మీ చేతికి వేడిని ఎంత వేగంగా ప్రసరింపజేస్తుందో చూపిస్తుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 3,
    "concept": "convection",
    "title_en": "Rice Cooking in Pot",
    "title_te": "కుండలో అన్నం వండటం",
    "description_en": "When cooking rice, you can see bubbles rising as water at the bottom gets hot, rises up, and cooler water sinks down. This circular motion is convection, which cooks the rice evenly.",
    "description_te": "అన్నం వండేటప్పుడు, దిగువన నీరు వేడెక్కినప్పుడు పైకి లేస్తుంది మరియు చల్లని నీరు క్రింద మునుగుతుంది కాబట్టి మీరు బుడగలు పైకి లేవడం చూడవచ్చు. ఈ వృత్తాకార కదలిక ఉష్ణప్రసరణ, ఇది అన్నాన్ని సమానంగా ఉడికిస్తుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 4,
    "concept": "convection",
    "title_en": "Ceiling Fan Cooling",
    "title_te": "సీలింగ్ ఫ్యాన్ చల్లబరచడం",
    "description_en": "A ceiling fan doesn't make the air colder, but it creates convection currents that move warm air away from your body and bring cooler air near you, making you feel comfortable.",
    "description_te": "సీలింగ్ ఫ్యాన్ గాలిని చల్లగా చేయదు, కానీ అది ఉష్ణప్రసరణ ప్రవాహాలను సృష్టిస్తుంది, ఇవి మీ శరీరం నుండి వెచ్చని గాలిని దూరంగా మరియు మీ దగ్గరికి చల్లని గాలిని తీసుకువస్తాయి, దీనివల్ల మీరు సౌకర్యంగా అనుభూతి చెందుతారు.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 5,
    "concept": "convection",
    "title_en": "Sea Breeze at Beach",
    "title_te": "బీచ్‌లో సముద్ర గాలి",
    "description_en": "During daytime at Visakhapatnam or Chennai beach, you feel cool breeze from the sea. This happens because land heats faster than water, creating convection currents that bring cool air from sea to land.",
    "description_te": "పగటి సమయంలో విశాఖపట్నం లేదా చెన్నై బీచ్‌లో, మీరు సముద్రం నుండి చల్లని గాలిని అనుభూతి చెందుతారు. భూమి నీటి కంటే వేగంగా వేడెక్కుతుంది కాబట్టి ఇది జరుగుతుంది, సముద్రం నుండి భూమికి చల్లని గాలిని తీసుకువచ్చే ఉష్ణప్రసరణ ప్రవాహాలను సృష్టిస్తుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 6,
    "concept": "radiation",
    "title_en": "Drying Clothes in Sunlight",
    "title_te": "సూర్యరశ్మిలో బట్టలు ఆరబెట్టడం",
    "description_en": "When you hang wet clothes in sunlight, they dry faster than in shade. Sun's heat reaches the clothes through radiation (electromagnetic waves) without needing air or water to carry it.",
    "description_te": "మీరు తడి బట్టలను సూర్యరశ్మిలో వ వేసినప్పుడు, అవి నీడలో కంటే వేగంగా ఆరిపోతాయి. సూర్యుని వేడి వికిరణం (విద్యుదయస్కాంత తరంగాలు) ద్వారా బట్టలను చేరుకుంటుంది, దీనికి గాలి లేదా నీరు అవసరం లేదు.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 7,
    "concept": "radiation",
    "title_en": "Sitting Near Fire in Winter",
    "title_te": "చలికాలంలో అగ్ని దగ్గర కూర్చోవడం",
    "description_en": "In villages, people sit around a fire (bonfire or chulha) in cold nights. Even without touching the fire or standing in smoke, you feel warm because heat reaches you through radiation.",
    "description_te": "గ్రామాలలో, చల్లని రాత్రులలో ప్రజలు అగ్ని చుట్టూ కూర్చుంటారు. అగ్నిని తాకకుండా లేదా పొగలో నిలబడకుండా కూడా, మీరు వెచ్చగా అనుభూతి చెందుతారు ఎందుకంటే వేడి వికిరణం ద్వారా మిమ్మల్ని చేరుకుంటుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 8,
    "concept": "radiation",
    "title_en": "Black vs White Shirts in Summer",
    "title_te": "వేసవిలో నలుపు మరియు తెలుపు చొక్కాలు",
    "description_en": "Wearing a black shirt in hot summer makes you feel hotter than wearing white. Black color absorbs more radiation from the Sun, while white reflects most of it, keeping you cooler.",
    "description_te": "వేడి వేసవిలో నలుపు చొక్కా ధరించడం తెలుపు ధరించడం కంటే మిమ్మల్ని వేడిగా అనుభూతి చేస్తుంది. నలుపు రంగు సూర్యుడి నుండి ఎక్కువ వికిరణాన్ని గ్రహిస్తుంది, తెలుపు దానిలో చాలా భాగాన్ని ప్రతిబింబిస్తుంది, మిమ్మల్ని చల్లగా ఉంచుతుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 9,
    "concept": "insulation",
    "title_en": "Thermos Flask for Hot Water",
    "title_te": "వేడి నీటి కోసం థర్మస్ ఫ్లాస్క్",
    "description_en": "A thermos flask keeps hot water hot for hours. It has double walls with vacuum between them, preventing heat loss by conduction and convection. The shiny inner surface reflects radiation back.",
    "description_te": "థర్మస్ ఫ్లాస్క్ వేడి నీటిని గంటల తరబడి వేడిగా ఉంచుతుంది. దానికి వాక్యూమ్‌తో కూడిన రెండు గోడలు ఉన్నాయి, ప్రసరణ మరియు ఉష్ణప్రసరణ ద్వారా వేడి నష్టాన్ని నివారిస్తుంది. మెరుస్తున్న లోపలి ఉపరితలం వికిరణాన్ని తిరిగి ప్రతిబింబిస్తుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 10,
    "concept": "insulation",
    "title_en": "Woolen Shawl in Winter",
    "title_te": "చలికాలంలో ఉన్ని శాలువా",
    "description_en": "Grandmothers wear woolen shawls in winter to stay warm. Wool traps air between its fibers, and since air is a poor conductor, it prevents body heat from escaping, keeping them warm.",
    "description_te": "వేడిగా ఉండటానికి అమ్మమ్మలు చలికాలంలో ఉన్ని శాలువాలు ధరిస్తారు. ఉన్ని దాని తంతువుల మధ్య గాలిని బంధిస్తుంది మరియు గాలి చెడు వాహకం కాబట్టి, ఇది శరీర వేడి బయటకు వెళ్లకుండా నిరోధిస్తుంది, వారిని వెచ్చగా ఉంచుతుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 11,
    "concept": "thermal expansion",
    "title_en": "Jar Lid Opening with Hot Water",
    "title_te": "వేడి నీటితో జార్ మూత తెరవడం",
    "description_en": "When a metal jar lid is stuck, pouring hot water on it helps open it easily. The metal lid expands more than the glass jar when heated, making it looser and easier to twist off.",
    "description_te": "లోహపు జార్ మూత ఇరుక్కున్నప్పుడు, దానిపై వేడి నీరు పోయడం దాన్ని సులభంగా తెరవడంలో సహాయపడుతుంది. వేడి చేసినప్పుడు లోహపు మూత గాజు జార్ కంటే ఎక్కువ విస్తరిస్తుంది, దీన్ని వదులుగా మరియు తిప్పడానికి సులభంగా చేస్తుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 12,
    "concept": "thermal expansion",
    "title_en": "Railway Track Gaps",
    "title_te": "రైల్వే ట్రాక్ గ్యాప్‌లు",
    "description_en": "If you look closely at railway tracks, you'll see small gaps between sections. These gaps allow tracks to expand in hot summer without bending. Without gaps, tracks would buckle and cause accidents.",
    "description_te": "మీరు రైల్వే ట్రాక్‌లను దగ్గరగా చూస్తే, విభాగాల మధ్య చిన్న గ్యాప్‌లను చూస్తారు. ఈ గ్యాప్‌లు వేడి వేసవిలో ట్రాక్‌లు వంగకుండా విస్తరించడానికి అనుమతిస్తాయి. గ్యాప్‌లు లేకుండా, ట్రాక్‌లు వంగి ప్రమాదాలకు కారణమవుతాయి.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 13,
    "concept": "evaporation",
    "title_en": "Wet Floor Drying",
    "title_te": "తడి నేల ఆరిపోవడం",
    "description_en": "After mopping the floor with water, it dries faster in summer than in monsoon. Heat from surroundings gives water molecules energy to escape as vapor, which is evaporation. More heat means faster drying.",
    "description_te": "నీటితో నేలను తుడిచిన తర్వాత, వేసవిలో వర్షాకాలం కంటే వేగంగా ఆరిపోతుంది. పరిసరాల నుండి వేడి నీటి అణువులకు ఆవిరిగా తప్పించుకోవడానికి శక్తిని ఇస్తుంది, ఇది బాష్పీభవనం. ఎక్కువ వేడి అంటే వేగవంతమైన ఆరబెట్టడం.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 14,
    "concept": "evaporation",
    "title_en": "Matka (Clay Pot) Cooling Water",
    "title_te": "మట్టి కుండ (మట్కా) నీటిని చల్లబరచడం",
    "description_en": "Water stored in a clay matka tastes cooler than in plastic or steel. Water seeps through tiny pores in clay and evaporates, taking heat from remaining water and cooling it naturally.",
    "description_te": "మట్టి మట్కాలో నిల్వ చేసిన నీరు ప్లాస్టిక్ లేదా స్టీల్ కంటే చల్లగా రుచి చూస్తుంది. నీరు మట్టిలోని చిన్న రంధ్రాల ద్వారా వెళ్లి బాష్పీభవనం అవుతుంది, మిగిలిన నీటి నుండి వేడిని తీసుకొని దానిని సహజంగా చల్లబరుస్తుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 15,
    "concept": "condensation",
    "title_en": "Water Droplets on Cold Drink Glass",
    "title_te": "చల్లని డ్రింక్ గ్లాసుపై నీటి బిందువులు",
    "description_en": "When you pour cold water or soft drink in a glass, water droplets form outside. Water vapor in air touches the cold glass, loses heat, and condenses into liquid droplets.",
    "description_te": "మీరు గ్లాసులో చల్లని నీరు లేదా సాఫ్ట్ డ్రింక్ పోసినప్పుడు, బయట నీటి బిందువులు ఏర్పడతాయి. గాలిలో నీటి ఆవిరి చల్లని గ్లాసును తాకి, వేడిని కోల్పోయి, ద్రవ బిందువులుగా సంగ్రహిస్తుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 16,
    "concept": "condensation",
    "title_en": "Morning Dew on Grass",
    "title_te": "గడ్డిపై ఉదయం మంచు",
    "description_en": "Early morning, grass and leaves have water droplets even though it didn't rain. At night, surfaces cool down, causing water vapor in air to condense into dew drops.",
    "description_te": "తెల్లవారుజామున, వర్షం కురవకపోయినా గడ్డి మరియు ఆకులపై నీటి బిందువులు ఉంటాయి. రాత్రి సమయంలో, ఉపరితలాలు చల్లబడతాయి, గాలిలో నీటి ఆవిరి మంచు బిందువులుగా సంగ్రహించడానికి కారణమవుతుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 17,
    "concept": "boiling",
    "title_en": "Pressure Cooker Whistle",
    "title_te": "ప్రెజర్ కుక్కర్ విజిల్",
    "description_en": "When cooking dal or rice in pressure cooker, it whistles when steam builds up. Water boils at 100°C normally, but under pressure, it boils at higher temperature, cooking food faster.",
    "description_te": "ప్రెజర్ కుక్కర్‌లో పప్పు లేదా అన్నం వండేటప్పుడు, ఆవిరి పెరిగినప్పుడు విజిల్ ఊదుతుంది. నీరు సాధారణంగా 100°C వద్ద మరుగుతుంది, కానీ పీడనంలో, అది అధిక ఉష్ణోగ్రత వద్ద మరుగుతుంది, ఆహారాన్ని వేగంగా ఉడికిస్తుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 18,
    "concept": "melting",
    "title_en": "Ice Candy Melting",
    "title_te": "ఐస్ కాండీ కరగడం",
    "description_en": "On a hot day, ice candy (pepsi or orange bar) melts quickly if you don't eat it fast. Heat from air and your hand is absorbed by ice, changing it from solid to liquid.",
    "description_te": "వేడి రోజున, మీరు త్వరగా తినకపోతే ఐస్ కాండీ (పెప్సీ లేదా ఆరెంజ్ బార్) త్వరగా కరుగుతుంది. గాలి మరియు మీ చేతి నుండి వేడి మంచు ద్వారా గ్రహించబడుతుంది, దాన్ని ఘనం నుండి ద్రవంగా మారుస్తుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 19,
    "concept": "heat capacity",
    "title_en": "Hot Sand vs Cool Water at Beach",
    "title_te": "బీచ్‌లో వేడి ఇసుక మరియు చల్లని నీరు",
    "description_en": "At noon on a beach, sand becomes burning hot but sea water stays cool. Sand has low specific heat and heats up quickly, while water has high specific heat and takes longer to warm up.",
    "description_te": "మధ్యాహ్నం బీచ్‌లో, ఇసుక కాల్చే వేడిగా మారుతుంది కానీ సముద్ర నీరు చల్లగా ఉంటుంది. ఇసుక తక్కువ విశిష్ట వేడిని కలిగి ఉంటుంది మరియు వేగంగా వేడెక్కుతుంది, నీరు అధిక విశిష్ట వేడిని కలిగి ఉంటుంది మరియు వెచ్చగా ఉండటానికి ఎక్కువ సమయం పడుతుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  },
  {
    "id": 20,
    "concept": "conductivity comparison",
    "title_en": "Steel vs Wooden Bench in Park",
    "title_te": "పార్కులో స్టీల్ మరియు చెక్క బెంచ్",
    "description_en": "In a park, sitting on a steel bench feels colder in winter than a wooden bench, even though both are at same temperature. Steel conducts heat away from your body faster than wood.",
    "description_te": "పార్కులో, స్టీల్ బెంచ్‌పై కూర్చోవడం రెండు ఒకే ఉష్ణోగ్రత వద్ద ఉన్నప్పటికీ చెక్క బెంచ్ కంటే చలికాలంలో చల్లగా అనిపిస్తుంది. స్టీల్ చెక్క కంటే మీ శరీరం నుండి వేడిని వేగంగా ప్రసరింపజేస్తుంది.",
    "culturally_relevant": true,
    "classroom_tested": true
  }
]